app/Controllers/Data/Datamember.php

SELECT *
FROM `member`
---
    public function index()
    {
        $member = new MemberModels();
        $data['member'] = $member->findAll();