app/Controllers/Data/Dataparkir.php

    public function index()
    {
        $parkir = new ParkirModels();
        $data['parkir'] = $parkir->findAll();
---
SELECT *
FROM `parkir`